In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4),
            index = dates,
            columns = list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-06  1.586017  0.423120 -1.013089 -0.957285

In [9]:
df2 = pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20130102"),
        "C":pd.Series([1.2,2.3,3.4,4.5],index = list(range(4)), dtype = "float32"),
        "D":np.array([1,2,3,4], dtype = "int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F":"foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.2  1   test  foo
1  1.0 2013-01-02  2.3  2  train  foo
2  1.0 2013-01-02  3.4  3   test  foo
3  1.0 2013-01-02  4.5  4  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df2.all

<bound method DataFrame.all of      A          B    C  D      E    F
0  1.0 2013-01-02  1.2  1   test  foo
1  1.0 2013-01-02  2.3  2  train  foo
2  1.0 2013-01-02  3.4  3   test  foo
3  1.0 2013-01-02  4.5  4  train  foo>

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062
2013-01-05  0.650158  0.488456 -1.332476  1.428340

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-06  1.586017  0.423120 -1.013089 -0.957285

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy()

array([[-0.9363929 ,  0.71921615,  0.65955121, -1.07135586],
       [-0.03789566, -0.24002553, -0.46540637,  0.16123651],
       [ 0.61962603, -0.01968108,  0.20614911, -1.20910657],
       [-0.04548284, -1.35124275, -0.48904203,  0.19106218],
       [ 0.65015833,  0.4884556 , -1.33247585,  1.42833999],
       [ 1.58601732,  0.42312026, -1.01308877, -0.957285  ]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.2000000476837158, 1,
        'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 2.299999952316284, 2,
        'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 3.4000000953674316, 3,
        'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 4.5, 4, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.306005  0.003307 -0.405719 -0.242851
std    0.853299  0.750824  0.741278  1.027125
min   -0.936393 -1.351243 -1.332476 -1.209107
25%   -0.043586 -0.184939 -0.882077 -1.042838
50%    0.290865  0.201720 -0.477224 -0.398024
75%    0.642525  0.472122  0.038260  0.183606
max    1.586017  0.719216  0.659551  1.428340

In [21]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.2,2.3,3.4,4.5
D,1,2,3,4
E,test,train,test,train
F,foo,foo,foo,foo

In [24]:
df.sort_index(axis = 0, ascending = False)

                   A         B         C         D
2013-01-06  1.586017  0.423120 -1.013089 -0.957285
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-01 -0.936393  0.719216  0.659551 -1.071356

In [25]:
df.sort_values(by = "B", ascending = False)

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-06  1.586017  0.423120 -1.013089 -0.957285
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062

In [27]:
df["A"]

2013-01-01   -0.936393
2013-01-02   -0.037896
2013-01-03    0.619626
2013-01-04   -0.045483
2013-01-05    0.650158
2013-01-06    1.586017
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107

In [30]:
df["2013-01-01":"2013-01-03"]

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107

In [33]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [34]:
df.loc[dates[0]]

A   -0.936393
B    0.719216
C    0.659551
D   -1.071356
Name: 2013-01-01 00:00:00, dtype: float64

In [35]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -0.936393  0.719216
2013-01-02 -0.037896 -0.240026
2013-01-03  0.619626 -0.019681
2013-01-04 -0.045483 -1.351243
2013-01-05  0.650158  0.488456
2013-01-06  1.586017  0.423120

In [39]:
df.loc["2013-01-01":"2013-01-03", ["A", "C"]]

                   A         C
2013-01-01 -0.936393  0.659551
2013-01-02 -0.037896 -0.465406
2013-01-03  0.619626  0.206149

In [37]:
df.loc["2013-01-02", ["A"]]

A   -0.037896
Name: 2013-01-02 00:00:00, dtype: float64

In [38]:
df.loc[dates[0], "A"]

-0.93639290173157

In [40]:
df.iloc[3]

A   -0.045483
B   -1.351243
C   -0.489042
D    0.191062
Name: 2013-01-04 00:00:00, dtype: float64

In [41]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.045483 -1.351243
2013-01-05  0.650158  0.488456

In [42]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.037896 -0.465406
2013-01-03  0.619626  0.206149
2013-01-05  0.650158 -1.332476

In [43]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107

In [44]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.719216  0.659551
2013-01-02 -0.240026 -0.465406
2013-01-03 -0.019681  0.206149
2013-01-04 -1.351243 -0.489042
2013-01-05  0.488456 -1.332476
2013-01-06  0.423120 -1.013089

In [45]:
df.iloc[1,1]

-0.24002552571749106

In [46]:
df.iat[1,1]

-0.24002552571749106

In [47]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-06  1.586017  0.423120 -1.013089 -0.957285

In [48]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.719216  0.659551       NaN
2013-01-02       NaN       NaN       NaN  0.161237
2013-01-03  0.619626       NaN  0.206149       NaN
2013-01-04       NaN       NaN       NaN  0.191062
2013-01-05  0.650158  0.488456       NaN  1.428340
2013-01-06  1.586017  0.423120       NaN       NaN

In [49]:
df2 =  df.copy()

df2

                   A         B         C         D
2013-01-01 -0.936393  0.719216  0.659551 -1.071356
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237
2013-01-03  0.619626 -0.019681  0.206149 -1.209107
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062
2013-01-05  0.650158  0.488456 -1.332476  1.428340
2013-01-06  1.586017  0.423120 -1.013089 -0.957285

In [50]:
df2["E"] = ['one', 'one', 'two', 'three', 'four', 'three']

In [51]:
df2

                   A         B         C         D      E
2013-01-01 -0.936393  0.719216  0.659551 -1.071356    one
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237    one
2013-01-03  0.619626 -0.019681  0.206149 -1.209107    two
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062  three
2013-01-05  0.650158  0.488456 -1.332476  1.428340   four
2013-01-06  1.586017  0.423120 -1.013089 -0.957285  three

In [52]:
df2[df2["E"].isin(['two', 'four',])]

                   A         B         C         D     E
2013-01-03  0.619626 -0.019681  0.206149 -1.209107   two
2013-01-05  0.650158  0.488456 -1.332476  1.428340  four

In [53]:
s1 = pd.Series(
    [1,2,3,4,5,6],
    index = pd.date_range("20130102", periods = 6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [54]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.936393  0.719216  0.659551 -1.071356  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237  1.0
2013-01-03  0.619626 -0.019681  0.206149 -1.209107  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062  3.0
2013-01-05  0.650158  0.488456 -1.332476  1.428340  4.0
2013-01-06  1.586017  0.423120 -1.013089 -0.957285  5.0

In [55]:
df.at[dates[0], "A"]  = 0

In [56]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.719216  0.659551 -1.071356  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237  1.0
2013-01-03  0.619626 -0.019681  0.206149 -1.209107  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062  3.0
2013-01-05  0.650158  0.488456 -1.332476  1.428340  4.0
2013-01-06  1.586017  0.423120 -1.013089 -0.957285  5.0

In [57]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.659551 -1.071356  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  0.161237  1.0
2013-01-03  0.619626 -0.019681  0.206149 -1.209107  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  0.191062  3.0
2013-01-05  0.650158  0.488456 -1.332476  1.428340  4.0
2013-01-06  1.586017  0.423120 -1.013089 -0.957285  5.0

In [58]:
df.loc[:, "D"] = np.array([5]*len(df))

In [59]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.659551  5  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0
2013-01-03  0.619626 -0.019681  0.206149  5  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  5  3.0
2013-01-05  0.650158  0.488456 -1.332476  5  4.0
2013-01-06  1.586017  0.423120 -1.013089  5  5.0

In [60]:
df2 = df.copy()
df2[df> 0] = -df2

In [61]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.659551 -5  NaN
2013-01-02 -0.037896 -0.240026 -0.465406 -5 -1.0
2013-01-03 -0.619626 -0.019681 -0.206149 -5 -2.0
2013-01-04 -0.045483 -1.351243 -0.489042 -5 -3.0
2013-01-05 -0.650158 -0.488456 -1.332476 -5 -4.0
2013-01-06 -1.586017 -0.423120 -1.013089 -5 -5.0

In [63]:
df1 = df.reindex(
    index = dates[0:4],
    columns = list(df.columns) + ["E"]
)

df1.loc[dates[0]:dates[1], "E"] = 1

df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.659551  5  NaN  1.0
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0  1.0
2013-01-03  0.619626 -0.019681  0.206149  5  2.0  NaN
2013-01-04 -0.045483 -1.351243 -0.489042  5  3.0  NaN

In [64]:
df1.dropna(how = "any")

                   A         B         C  D    F    E
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0  1.0

In [65]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.659551  5  5.0  1.0
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0  1.0
2013-01-03  0.619626 -0.019681  0.206149  5  2.0  5.0
2013-01-04 -0.045483 -1.351243 -0.489042  5  3.0  5.0

In [66]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [67]:
df.mean()

A    0.462071
B   -0.116562
C   -0.405719
D    5.000000
F    3.000000
dtype: float64

In [68]:
df.mean(1)

2013-01-01    1.414888
2013-01-02    1.051334
2013-01-03    1.561219
2013-01-04    1.222846
2013-01-05    1.761228
2013-01-06    2.199210
Freq: D, dtype: float64

In [76]:
s = pd.Series([1,3,5,np.nan, 6,8],
         index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [77]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.659551  5  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0
2013-01-03  0.619626 -0.019681  0.206149  5  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  5  3.0
2013-01-05  0.650158  0.488456 -1.332476  5  4.0
2013-01-06  1.586017  0.423120 -1.013089  5  5.0

In [78]:
df.sub(s, axis = "index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.380374 -1.019681 -0.793851  4.0  1.0
2013-01-04 -3.045483 -4.351243 -3.489042  2.0  0.0
2013-01-05 -4.349842 -4.511544 -6.332476  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [79]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.659551  5  NaN
2013-01-02 -0.037896 -0.240026 -0.465406  5  1.0
2013-01-03  0.619626 -0.019681  0.206149  5  2.0
2013-01-04 -0.045483 -1.351243 -0.489042  5  3.0
2013-01-05  0.650158  0.488456 -1.332476  5  4.0
2013-01-06  1.586017  0.423120 -1.013089  5  5.0

In [80]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.659551   5   NaN
2013-01-02 -0.037896 -0.240026  0.194145  10   1.0
2013-01-03  0.581730 -0.259707  0.400294  15   3.0
2013-01-04  0.536248 -1.610949 -0.088748  20   6.0
2013-01-05  1.186406 -1.122494 -1.421224  25  10.0
2013-01-06  2.772423 -0.699374 -2.434313  30  15.0

In [81]:
df.apply(lambda x: x.max() - x.min())

A    1.631500
B    1.839698
C    1.992027
D    0.000000
F    4.000000
dtype: float64

In [84]:
s = pd.Series(
    np.random.randint(0,7,size=10)
)
s

0    1
1    0
2    6
3    3
4    1
5    3
6    3
7    6
8    6
9    6
dtype: int64

In [85]:
s.value_counts()

6    4
3    3
1    2
0    1
dtype: int64

In [87]:
s = pd.Series([
    "A", "B", "C", "AbBa", "Baca", np.nan, "CACA", "dog", "cat",
])

s

0       A
1       B
2       C
3    AbBa
4    Baca
5     NaN
6    CACA
7     dog
8     cat
dtype: object

In [88]:
s.str.lower()

0       a
1       b
2       c
3    abba
4    baca
5     NaN
6    caca
7     dog
8     cat
dtype: object

In [89]:
df = pd.DataFrame(
    np.random.randn(10, 4)
)

df

          0         1         2         3
0  1.003052 -1.158195  1.099770  0.276544
1 -1.336129  0.382518 -0.458995 -1.142587
2  2.972191 -1.178694  0.443032  0.909951
3 -1.781904  1.023055 -0.616467 -1.398447
4 -0.778485  0.335302 -1.308650  0.937298
5 -0.732018  0.599239 -0.065702  2.999327
6 -0.689773  2.635464 -0.067023 -1.083899
7 -0.526824  0.016999 -0.870634  0.415134
8  0.103596 -0.546802 -1.163499 -0.158713
9  1.348029  0.164234 -0.173852 -0.353200

In [90]:
pieces = [df[:3], df[3:7], df[7:]]

In [91]:
for d in pieces:
    print(d)

          0         1         2         3
0  1.003052 -1.158195  1.099770  0.276544
1 -1.336129  0.382518 -0.458995 -1.142587
2  2.972191 -1.178694  0.443032  0.909951
          0         1         2         3
3 -1.781904  1.023055 -0.616467 -1.398447
4 -0.778485  0.335302 -1.308650  0.937298
5 -0.732018  0.599239 -0.065702  2.999327
6 -0.689773  2.635464 -0.067023 -1.083899
          0         1         2         3
7 -0.526824  0.016999 -0.870634  0.415134
8  0.103596 -0.546802 -1.163499 -0.158713
9  1.348029  0.164234 -0.173852 -0.353200

In [92]:
pd.concat(pieces)

          0         1         2         3
0  1.003052 -1.158195  1.099770  0.276544
1 -1.336129  0.382518 -0.458995 -1.142587
2  2.972191 -1.178694  0.443032  0.909951
3 -1.781904  1.023055 -0.616467 -1.398447
4 -0.778485  0.335302 -1.308650  0.937298
5 -0.732018  0.599239 -0.065702  2.999327
6 -0.689773  2.635464 -0.067023 -1.083899
7 -0.526824  0.016999 -0.870634  0.415134
8  0.103596 -0.546802 -1.163499 -0.158713
9  1.348029  0.164234 -0.173852 -0.353200

In [96]:
left = pd.DataFrame(
    {"key":["foo", "foo"],
    "lval":[1,2]}
)

left

   key  lval
0  foo     1
1  foo     2

In [97]:
right = pd.DataFrame(
    {"key":["foo", "foo"],
    "rval":[4,5]}
)

right

   key  rval
0  foo     4
1  foo     5

In [98]:
pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [99]:
left = pd.DataFrame(
    {"key":["foo", "bar"],
    "lval":[1,2]}
)

right = pd.DataFrame(
    {"key":["bar", "foo"],
    "rval":[4,5]}
)

pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     5
1  bar     2     4

In [100]:
df = pd.DataFrame(
    {
        "A":["foo", "bar", "foo", "bar"],
        "B":["one", "one", "two", "three"],
        "C":np.random.randn(4),
        "D":np.random.randn(4),
    }
)

df

     A      B         C         D
0  foo    one -0.655793  1.611343
1  bar    one -0.034748 -0.938225
2  foo    two -0.515878  0.429424
3  bar  three  1.271820 -0.502358

In [102]:
df.groupby("A").sum()

            C         D
A
bar  1.237072 -1.440584
foo -1.171671  2.040767

In [103]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.034748 -0.938225
    three  1.271820 -0.502358
foo one   -0.655793  1.611343
    two   -0.515878  0.429424

## Reshaping